function info(){
    let text = '˚ ⋆ ⨻ ︵ ⨻･<br>'
                    +'（≽^•⩊•^≼）₊˚ ⊹ ♡ ☆<br>'
                    +'╔══U═U════════- ☆ ˚⋆ ༘✶ ⋆｡˚ ⁀➷<br>'
                    +'⣀⣀⣤⣤⣶۩ .･ Вітаю тебе!･. ۩⣦⣤⣀⣀<br>'
                    +'<br>'
                    +'Тебе цікавить хто я і навіщо я? Можна сказати, що я бот для дозвілля 😉. У мене є те, що і у багатьох інших ботів, але також і дещо особливе 😏. ➶ ˚<br>'
                    +'<br>'
                    +'⣀⣀⣀⣀⣤⣤⣶⣾ Після того, як ти додаси мене на сервер ⣶⣶⣦⣤⣀⣀⣀⣀⣀<br>'
                    +'<br>'
                    +'👀꒱ я почну вести підрахунок кількості повідомлень 💬 і хвилин в войсах 🔊 користувачів сервера, за певну кількість можуть видаватися ролі рівнів (див. <button class="commButt" onclick="f_doCommand(20)">/ролі перелік</button> - доступно лише адміністраторам)<br>'
                    +'👀꒱ вести підрахунок текстової 🖋️ та голосової 🎙️ активності користувачів сервера, яку конвертую в коїни 🪙 (див. <button class="commButt" onclick="f_doCommand(3)">/профіль хелп</button>)<br>'
                    +'👀꒱ вести підрахунок ігрової активності користувачів сервера 🎮, яку можна буде пізніше подивитися в ігровому профілі користувача (див. <button class="commButt" onclick="f_doCommand(4)">/ігри @user</button>). а також при пошуку користувачів, які грали або грають в певну гру (див. <button class="commButt" onclick="f_doCommand(6)">/хто-грає [зараз] [ назва-гри ]</button>)<br>'
                    +'<br>'
                    +'⣀⣀⣤⣤⣶⣾ Зі мною ти можеш ⣶⣶⣦⣤⣀⣀⣀⣀<br>'
                    +'😻˚ оцінювати карму /няшність користувачів  (див. <button class="commButt" onclick="f_doCommand(3)">/профіль хелп</button>),<br>'
                    +'🍄˚ грати в ігри Зомбі, Крокодил, Гриби, Рулетка та інший інтерактив (див. <button class="commButt" onclick="games()">/хелп категорія:ігри</button>),<br>'
                    +'💫˚ мутити різне (див. <button class="commButt" onclick="dowith()">/замути ...</button>),<br>'
                    +'💏˚ виражати свої реакції вбудованими повідомленнями (див. <button class="commButt" onclick="reactions()">/хелп категорія:фан</button>, <button class="commButt" onclick="dowith()">/хелп категорія:дії</button>),<br>'
                    +'🛒˚ купувати ігрові ролі за коїни, обмінюватися коїнами  (див. <button class="commButt" onclick="economics()">/хелп категорія:економіка</button>),<br>'
                    +'🛠️˚ налаштовувати параметри сервера в базі бота, щоб максимально оптимізувати можливості бота для сервера  (див. <button class="commButt" onclick="f_doCommand(19)">/сервер задати:true</button> - доступно лише адміністраторам),<br>'
                    +'⚠️˚ гнучко керувати користувачами: всі бани ⛔, мути 🔇 та попередження ⚠️ записуються в досьє користувача, з виведенням дати, причини та того, хто видав, та зберігаються після видалення користувача із сервера  (див. <button class="commButt" onclick="admin()">/хелп категорія:адмін</button> - доступно лише адміністраторам),<br>'
                    +'🤡˚ налаштувати і автоматизувати видачу ролей (див. <button class="commButt" onclick="f_doCommand(20)">/ролі перелік</button> - доступно лише адміністраторам):,<br>'
                    +'✦ ролі по реакції на повідомлення 💛💚 (див. <button class="commButt" onclick="f_doCommand(23)">/колірніка</button> - доступно лише адміністраторам)<br>'
                    +'✦ ролі за кількість повідомлень/секунд у голосових каналах<br>'
                    +'✦ ролі, що видаються новим учасникам<br>'
                    +'✦ покупні ролі (див. <button class="commButt" onclick="f_doCommand(32)">/купити</button>)<br>'
                    +'✦ а також створити ролі, що автоматично видаються учасникам при запуску певної гри (див. <button class="commButt" onclick="f_doCommand(22)">/роль-за-гру</button> - доступно лише адміністраторам)<br>'
                    +'📝˚ можна увімкнути логи подій (додавання/видалення користувачів, ролей і ролей користувачам) (див. <button class="commButt" onclick="f_doCommand(19)">/сервер задати:true тип:doLogs</button> - увімкнути логи, <button class="commButt" onclick="f_doCommand(19)">/сервер задати:true тип:updatesChannelId</button> - id каналу для відправки логів, доступно лише адміністраторам)<br>'
                    +'°• ➵ Вся навігація доступна починаючи з команди <button class="commButt" onclick="f_doCommand(17)">/хелп</button><br>'
                    +'Автор бота - FlySquirrel (діскорд - .flysquirr)';
    document.getElementById("commandList").innerHTML = text;
}

function news(){
    let text = '';
    document.getElementById("commandList").innerHTML = text;
}

const commArr = [
        {
            cathegory:'main',
            name:'/інфо',
            functionName:'f_doCommand(0)',
            descr:'виводить інформацію про бота',
            msgInput:'/інфо',
            msgOutput:'˚⋆⨻ ︵ ⨻･<br>'
                    +'（≽^•⩊•^≼）₊˚ ⊹ ♡ ☆<br>'
                    +'╔══U═U════════- ☆ ˚⋆ ༘✶ ⋆｡˚ ⁀➷<br>'
                    +'⣀⣀⣤⣤⣶۩ .･ Вітаю тебе!･. ۩⣦⣤⣀⣀<br>'
                    +'\<br\>'
                    +'Тебе цікавить хто я і навіщо я? Можна сказати, що я бот для дозвілля 😉. У мене є те, що і у багатьох інших ботів, але також і дещо особливе 😏. ➶ ˚\<br\>'
                    +'...',
            params:[],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/досьє',
            functionName:'f_doCommand(1)',
            descr:'показує загальну інформацію про користувача, а також список банів, мутів і варнів',
            msgInput:'/досьє',
            msgOutput:'<div style="float:right"><img src="/public/rhombimedia/flysqavatar.jpg"/></div>'
                        +'📋 <b>flysquirr</b>, відомий як <b>FlySquirrel</b><br>'
                        +'На сервері з 24 тра 2025<br>'
                        +'Аккаунт створений 30 бер 2020<br><br>'
                        +'⚠️ <b>Список попереджень</b><br>'
                        +'-꒰ʚ відсутні ɞ꒱-<br><br>'
                        +'🔇 <b>Список мутів</b><br>'
                        +'-꒰ʚ відсутні ɞ꒱-<br><br>'
                        +'⛔ <b>Список банів</b><br>'
                        +'-꒰ʚ відсутні ɞ꒱-<br><br>'
                        +'/досьє @user',
            params:[
                {
                    name:'user',
                    value:'@FlySquirrel'
                }
            ],
            buttons:[],
            details:'Якщо не ввести параметр "user", то виведеться досьє автора команди',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/профіль',
            functionName:'f_doCommand(2)',
            descr:'профіль користувача на даному сервері: кількість повідомлень, хвилин у войсі, коїни, карма, няшність, професійні досягнення, інвертар',
            msgInput:'/профіль',
            msgOutput:'<div style="float:right"><img src="/public/rhombimedia/flysqavatar.jpg"/></div>'
                    +'┈┈┈┈┈┈୨◇୧┈┈┈┈┈┈ <br>'
                    +'๑۩╏ @FlySquirrel ╏°´<br>'
                    +'╭━━━━━━━━━━━━━━━━━━━━╮<br>'
                    +'100 ▣▢▢▢▢▢▢▢▢▢ 1000<br>'
                    +'╰━━━━━━━━━━<i>level bar</i>━╯<br>'
                    +'Кількість повідомлень: 100<br>'
                    +'Час в войсах: 10год 10хв<br><br>'
                    +'Text Coins: 517 ⊤₵<br>'
                    +'Voice Coins: 0 V₵<br><br>'
                    +'5х<img class="e" src="https://i.gifer.com/origin/62/629bcbb7b1e6e92d42c6f2d258392c37.gif"/> 2х<img class="e" src="https://media.tenor.com/0-M-_QQY4eQAAAAj/pixel-heart.gif"/> 2x<img class="e" src="https://media.tenor.com/eRnF_D3JcGwAAAAj/cafe.gif"/><br>'
                    +'Голосів на сьогодні: 10 / 10<br>'
                    +'Викопав яму глибиною 26 м <img class="e" src="/public/rhombimedia/emojis/rshowel.png"/><br>'
                    +'┈┈┈┈┈┈୨◇୧┈┈┈┈┈┈<br>'
                    +'๑۩╏ Інвертар ╏<br>'
                    +'пусто<br>'
                    +'/профіль',
            params:[],
            buttons:['Профіль', '◀ Інвертар', 'Інвертар ▶'],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/профіль хелп',
            functionName:'f_doCommand(3)',
            descr:'пояснення біль детально, що показано у профілі',
            msgInput:'/профіль хелп',
            msgOutput:'۩ .･Профіль Юзера･. ۩<br>'
                +'Всім юзерам выдається 10 голосів на день для зміни карми / няшності інших юзерів<br><br>'
                +'• підвищити карму можна @user + або однією із реакцій: ➕ 👍 😎<br>'
                +'• понизити карму можна @user - або однією із реакцій: ➖ 👎 ☹<br>'
                +'• за 100 карми юзер отримує роль @ɢᴏᴏᴅ ᴋᴀʀᴍᴀ😇<br>'
                +'• за -100 карми юзер отримує роль @ʙᴀᴅ ᴋᴀʀᴍᴀ😈<br><br>'
                +'• підвищити няшність можна однією із реакцій: ❤️ 😍 🖤<br>'
                +'• понизити няшність можна однією із реакцій: 💩 🤢 🤮<br>'
                +'• за 100 няшності юзер отримує роль @↜♥•𝙈𝙀𝙂𝘼𝙉𝙔𝘼𝙎𝙃•♥↝<br>'
                +'• за -100 няшності юзер отримує роль @T̶☢X̶I̶C̶<br><br>'
                +'• за текстову активність в чатах юзер отримує текстові коїни (⊤₵): 1 слів = 1 ⊤₵<br>'
                +'• за активність в голосових каналах юзер отримує войсові коїни (V₵): 180000 мс = 1 V₵<br>'
                +'• коїнами можна обмінюватися, а також купляти ролі та інші речі в магазині бота (див. /купити)<br><br>'
                +'Також за активність можна отримати наступні ролі:<br>'
                +'• |♟ гість | - за 1000 повідомлень<br>'
                +'• |♞ постоялець | - за 2000 повідомлень<br>'
                +'• |♜ житель | - за 3000 повідомлень<br>'
                +'• |♝ місцевий | - за 4000 повідомлень<br>'
                +'• |♚ свій | - за 5000 повідомлень<br><br>'
                +'В профілі відображаються також:<br>'
                +'кава <img class="e" src="https://media.tenor.com/eRnF_D3JcGwAAAAj/cafe.gif"/> і шмурдяк <img class="e" src="https://media3.giphy.com/media/v1.Y2lkPTc5MGI3NjExeTQ2a3Q3NG1vaGFmemozZG4zNWVzM3FobnNoMWt2cGdvcnVmemk2ZiZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9cw/IczsiWn1asYattzspI/giphy.gif"/>, приготовані баристою<br>'
                +'(див. /економіка бариста)<br>'
                +'глибина викопанної ями<br>'
                +'(див. /економіка копач)<br>'
                +'кількість заїздів і транспорт<br>'
                +'(див. /економіка гонщик)<br>'
                +'інвертар із виготовленими або відкопаними предметами<br>'
                +'(див. /економіка ремесленик)<br>'
                +'/профіль хелп',
            params:[
                {
                    name:'хелп',
                    value:'True'
                }
            ],
            buttons:[],
            details:'➤ Можна налаштувати на власний смак наступні параметри:'
                    +'<ul><li>кількість карми і няшності, за яку видаються ролі, а також вимкнути видавання ролей</li>'
                    +'<li>кількість разів на день, яку користувач може змінювати карму і няшність</li>'
                    +'<li>кількість слів та мілісекунд у войсі, еквівалентні 1 тестовому і войсовому коїну</li>'
                    +'<li>кількість повідомлень або хвилин у войсі, за яку користувач отримує роль або вимкнути видачу ролей (до 5 ролей, якщо треба більше, пишіть, можу організувати 😉)</li>'
                    +'<li>зовнішній вигляд ролей краще налаштовувати через команду /ролі змінити - так дані ролей будуть гарантовано актуалізовані</li>'
                    +'<li>можна налаштувати кількість покупних ролей, яку може мати один користувач</li></ul>'
                    +'➤ Якщо ролей ɢᴏᴏᴅ ᴋᴀʀᴍᴀ😇, ʙᴀᴅ ᴋᴀʀᴍᴀ😈, ↜♥•𝙈𝙀𝙂𝘼𝙉𝙔𝘼𝙎𝙃•♥↝ та/або T̶☢X̶I̶C̶ ще немає на сервері, вони будуть створені автоматично при виклику команди<br>'
                    +'➤ Також при створенні нових ролей створюється лог у випадку, якщо адміністратор серверу налаштує логування',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/ігри user',
            functionName:'f_doCommand(4)',
            descr:'показує, в які ігри грає користувач, розсортовані за спаданням кількості часу, проведеного у грі, із виведенням цього часу',
            msgInput:'/ігри',
            msgOutput:'<div style="float:right"><img src="/public/rhombimedia/flysqavatar.jpg"/></div>'
                    +'´°๑༺༽🎮 FlySquirrel 🎮༼༻๑°´<br>'
                    +'Цей юзер грає в 94 ігр:<br>'
                    +'🌌 Cube Escape Collection - 6 год 30 хв<br>'
                    +'🌌 Creepy Tale - 20 хв<br>'
                    +'🌌 Cube Escape: Paradox - 10 хв<br>'
                    +'🌌 Uran - запускав 4272 раз<br>'
                    +'🌌 Sid Meier\'s Civilization V - запускав 1522 раз<br>'
                    +'/ігри користувача @user | ▶ - вперед, ◀ - назад',
            buttons:[ '◀', '▶'],
            params:[
                {
                    name:'user',
                    value:'@FlySquirrel'
                }
            ],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/ігри сервера',
            functionName:'f_doCommand(5)',
            descr:'показує, в які ігри грають юзери на сервері, розсортовані по даті останнього запуску за спаданням',
            msgInput:'/ігри',
            msgOutput:'´°๑༺༽🎮 Активності 13th Avenue 🎮༼༻๑°´<br><br>'
                +'🚀 ccleaner64 ⏭ грали 1 юзерів<br>'
                +'⭯ останній запуск 1 тра 2025 | всього запусків 3<br><br>'
                +'🚀 Altium Designer (21.7.2) ⏭ грали 1 юзерів<br>'
                +'⭯ останній запуск 29 січ 2025 | всього запусків 39<br><br>'
                +'🚀 Frostpunk ⏭ грали 1 юзерів<br>'
                +'⭯ останній запуск 5 січ 2025 | всього запусків 383<br><br>'
                +'🚀 ONE PIECE BURNING BLOOD ⏭ грали 1 юзерів<br>'
                +'⭯ останній запуск 5 січ 2025 | всього запусків 3<br><br>'
                +'🚀 The Ascent ⏭ грали 1 юзерів<br>'
                +'⭯ останній запуск 5 січ 2025 | всього запусків 4<br><br>'
                +'🚀 Strange House ⏭ грали 1 юзерів<br>'
                +'⭯ останній запуск 1 січ 2025 | всього запусків 7<br><br>'
                +'🚀 Shut your teeth ⏭ грали 1 юзерів<br>'
                +'⭯ останній запуск 1 січ 2025 | всього запусків 3<br><br>'
                +'🚀 Do you have SALT? ⏭ грали 1 юзерів<br>'
                +'⭯ останній запуск 1 січ 2025 | всього запусків 3<br><br>'
                +'🚀 Deep Lake: Prologue ⏭ грали 1 юзерів<br>'
                +'⭯ останній запуск 1 січ 2025 | всього запусків 3<br><br>'
                +'🚀 Наружу ⏭ грали 1 юзерів<br>'
                +'⭯ останній запуск 1 січ 2025 | всього запусків 21<br><br>'
                +'/ігри сервера | ▶ - вперед, ◀ - назад',
            params:[
                {
                    name:'параметр',
                    value:'сервера'
                }
            ],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/хто-грає [зараз] [ <назва гри> ]',
            functionName:'f_doCommand(6)',
            descr:'подивитися хто грає у гру, яка вас цікавить, зараз або загалом',
            msgInput:'/хто-грає',
            msgOutput:'<img class="e" src="https://www.emojiall.com/images/240/telegram/1f50d.gif"/> У щось схоже по назві із Frostpunk грали:<br>'
                +'『✚』𝄃 Frostpunk 𝄂► FlySquirrel<br>'
                +'/хто-грає Frostpunk',
            params:[{
                    name:'назва-гри',
                    value:'Frostpunk'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/топ карма [тижня]',
            functionName:'f_doCommand(7)',
            descr:'виводить список топ 10 юзерів із найбільшою кармою на цьому сервері, цього тижня або загалом',
            msgInput:'/топ',
            msgOutput:'‧₊˚✧ 🌟 Топ карма 13th Avenue 🌟 ✧˚₊‧<br>'
            +'1 FlySquirrel - 20 ✦ ˚<br>'
            +'2 User 2 - 17 ✦ ˚<br>'
            +'3 RhombitruncatedIcosidodecahedron - 16 ✦ ˚<br>'
            +'FlySquirrel, у вас 20 карми',
            params:[{
                    name:'тип',
                    value:'карма'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/топ няш',
            functionName:'f_doCommand(8)',
            descr:'виводить список топ 10 юзерів із найбільшою няшністю на цьому сервері, цього тижня або загалом',
            msgInput:'/топ',
            msgOutput:'‧₊˚♡ 💗 Топові няші  13th Avenue 💗  ♡˚₊‧<br>'
            +'1 FlySquirrel - 20 ♥ ‧<br>'
            +'2 User 2 - 17 ♥ ‧<br>'
            +'3 RhombitruncatedIcosidodecahedron - 16 ♥ ‧<br>'
            +'FlySquirrel, у вас 20 няшності',
            params:[{
                    name:'тип',
                    value:'няш'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/топ тс',
            functionName:'f_doCommand(9)',
            descr:'виводить список топ 10 юзерів із найбільшою кількістю текстових коїнів на цьому сервері',
            msgInput:'/топ',
            msgOutput:'~o 🪙  Топ юзерів по ⊤₵ 13th Avenue 🪙  o~<br>'
            +'1 FlySquirrel - 20  ‧⊤₵‧˚<br>'
            +'2 User 2 - 17  ‧⊤₵‧˚<br>'
            +'3 RhombitruncatedIcosidodecahedron - 16  ‧⊤₵‧˚<br>'
            +'FlySquirrel, у вас 20 ⊤₵',
            params:[{
                    name:'тип',
                    value:'тс'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/топ вс',
            functionName:'f_doCommand(10)',
            descr:'виводить список топ 10 юзерів із найбільшою кількістю войсових коїнів на цьому сервері',
            msgInput:'/топ',
            msgOutput:'~o 🪙  Топ юзерів по V₵ 13th Avenue 🪙  o~<br>'
            +'1 FlySquirrel - 20  ‧V₵‧˚<br>'
            +'2 User 2 - 17  ‧V₵‧˚<br>'
            +'3 RhombitruncatedIcosidodecahedron - 16  ‧V₵‧˚<br>'
            +'FlySquirrel, у вас 20 V₵',
            params:[{
                    name:'тип',
                    value:'вс'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/топ ігр',
            functionName:'f_doCommand(11)',
            descr:'виводить список топ 10 ігр, в які востаннє грало найбільше людей',
            msgInput:'/топ',
            msgOutput:'´°๑༺༽ 🎮 Топ ігр 13th Avenue 🎮 ༼༻๑°´<br>'
            +'1 Minecraft   -   грало 8 чоловік'
            +'2 Hang Status   -   грало 8 чоловік'
            +'3 TLauncher   -   грало 7 чоловік'
            +'4 Counter-Strike 2   -   грало 6 чоловік'
            +'5 VALORANT   -   грало 6 чоловік',
            params:[{
                    name:'тип',
                    value:'вс'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/топ повідомлень',
            functionName:'f_doCommand(12)',
            descr:'виводить список топ 10 юзерів із найбільшою кількістю повідомлень на цьому сервері',
            msgInput:'/топ',
            msgOutput:'‧˚ღ 💌 Топ повідомлень  13th Avenue 💌  ఇ˚₊‧<br>'
            +'1 FlySquirrel - 20  ツ ˚<br>'
            +'2 User 2 - 17   ツ ˚<br>'
            +'3 RhombitruncatedIcosidodecahedron - 16   ツ ˚<br>'
            +'FlySquirrel, у вас 20 повідомлень',
            params:[{
                    name:'тип',
                    value:'повідомлень'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/топ хвилин у войсі',
            functionName:'f_doCommand(13)',
            descr:'виводить список топ 10 юзерів із найбільшою кількістю хвилин у войсах (у голосових каналах) на цьому сервері',
            msgInput:'/топ',
            msgOutput:'⊹ ₊˚ 🎙️ Топ хвилин у войсі 13th Avenue 🎙️ ₊˚⊹<br>'
            +'1 FlySquirrel - 1220 хвилин ‧◕˚<br>'
            +'2 User 2 - 17 хвилин ‧◕˚<br>'
            +'3 RhombitruncatedIcosidodecahedron - 16 хвилин ‧◕˚<br>'
            +'FlySquirrel, у вас 1220 хвилин у войсі',
            params:[{
                    name:'тип',
                    value:'хвилин у войсі'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/топ копачів',
            functionName:'f_doCommand(14)',
            descr:'виводить список топ 10 юзерів із найглибшою ямкою на цьому сервері (для тих, хто купив роль "Копач" і копав ямку)',
            msgInput:'/топ',
            msgOutput:'‧₊˚✩ <img class="e" src="/public/rhombimedia/emojis/rshowel.png"/> Топ копачів 13th Avenue <img class="e" src="/public/rhombimedia/emojis/rshowel.png"/> ੈ✩‧₊˚<br>'
            +'1 FlySquirrel - 20 м<br>'
            +'2 User 2 - 17 м<br>'
            +'3 RhombitruncatedIcosidodecahedron - м<br>'
            +'FlySquirrel, у вас яма глибиною 20 м',
            params:[{
                    name:'тип',
                    value:'копачів'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/топ гонщиків',
            functionName:'f_doCommand(15)',
            descr:'виводить список топ 10 юзерів із найбільшою кількістю заїздів на цьому сервері (для тих, хто купив роль "Гонщик": 1 заїзд = 1000 км, кожного дня можна проїхати рандомну дистанцію до 200 м)',
            msgInput:'/топ',
            msgOutput:'҉   🏁 Топ гонщиків 13th Avenue 🏁 ༄<br>'
            +'1 FlySquirrel - 20<br>'
            +'2 User 2 - 17<br>'
            +'3 RhombitruncatedIcosidodecahedron - 16<br>'
            +'FlySquirrel, у вас 20 заїздів. До наступного заїзду лишилося 951 км',
            params:[{
                    name:'тип',
                    value:'гонщиків'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/сервер',
            functionName:'f_doCommand(16)',
            descr:'виводить інформацію про сервер; адміністратори серверу можуть також бачити значення параметрів бота на даному сервері, доступних до редагування',
            msgInput:'/сервер',
            msgOutput:'<div style="float:right"><img src="indexfon.jpg" style="width:120px; height:120px"/></div>'
            +'<b>´°۩๑ Інформація про сервер 13th Avenue</b>\n'
            +'<b>Назва сервера</b>\n'
            +'13th Avenue\n'
            +'<b>Створення сервера</b>\n'
            +'Sat May 24 2025\n'
            +'<b>Ви приєдналися до сервера</b>\n'
            +'Sat May 24 2025\n'
            +'<b>Кількість учасників</b>\n'
            +'3\n'
            +'<b>Локаль</b>\n'
            +'uk\n'
            +'/сервер',
            params:[],
            buttons:[],
            details:'Поля, видимі адміністраторам, можуть мати приблизно наступний вигляд:<br><br>'
                    +'‿୨l║l° ﹤ ВІТАННЯ ﹥ °l║l୧‿<br>'
                    +'▶️ Id канала, де бот вітає нових користувачів = 1375947128815222946 (║-основний)<br>'
                    +'▶️ Вітати нових користувачів (true) або не вітати (false) = true<br>'
                    +'▶️ Вітальне повідомлення:<br>'
                    +'ну привіт, {member}<br><br>'
                    +'‿୨l║l° ﹤ ЕКОНОМІКА ﹥ °l║l୧‿<br>'
                    +'▶️ Кількість слів, еквівалентна 1 ⊤₵ (текстовому коїну) = 1 слів<br>'
                    +'▶️ Кількість мілісекунд, еквівалентна 1 V₵ (голосовому коїну) = 60000 мс<br>'
                    +'▶️ Мінімальна кількість коінів, яку можна передавати іншим користувачам = 50<br>'
                    +'▶️ Максимальна кількість коїнів, яку можна передавати іншим користувачам = 100<br>'
                    +'▶️ Максимальна кількість предметів в інвертарі = 50<br>'
                    +'▶️ Кількість покупних ролей, які може мати один користувач = 5<br><br>'
                    +'‿୨l║l° ﹤ КАРМА И НЯШНІСТЬ ﹥ °l║l୧‿<br>'
                    +'▶️ Кількість карми, після якої видається роль Good Karma и Bad Karma = 100 карми<br>'
                    +'▶️ Кількість няшності, після якої видається роль Toxic и Meganyash = 100 няшності<br>'
                    +'▶️ Скільки разів на день користувач може змінювати карму та няшність = 10 раз/день<br><br>'
                    +'‿୨l║l° ﹤ РОЛІ ﹥ °l║l୧‿<br>'
                    +'▶️ Видавати спеціальну роль новим користувачам (true) або не видавати (false) = false<br>'
                    +'▶️ Видавати спеціальну роль новим ботам (true) або не видавати (false) = false<br>'
                    +'▶️ Видавати ролі за кількість текстових повідомлень (true) чи не видавати (false) = true<br>'
                    +'▶️ Кількість ролей для зміни кольору ніка, що видаються за реакцією = 7<br>'
                    +'▶️ Видавати роль Good Karma та Bad Karma після досягнення рівня (true) або не видавати (false) = true<br>'
                    +'▶️ Видавати роль Toxic та Meganyash після досягнення рівня (true) або не видавати (false) = true<br><br>'
                    +'‿୨l║l° ﹤ ІНШЕ ﹥ °l║l୧‿<br>'
                    +'▶️ Мова бота = ua<br>'
                    +'▶️ Колір вертикальної смужки Embed-повідомлень = #BC2C52<br>'
                    +'▶️ Надсилати службові повідомлення та логи (додавання/видалення ролей, учасників, їх ролей, інформація про бани, мути та варни) в спеціальний канал = true<br>'
                    +'▶️ Id каналу, куди бот відправляє службові повідомлення = 1375946926784118834 (logs)<br>'
                    +'▶️ Кількість слів, після якої бот відповідає автору повідомлення рандомну фразу = 500 слів',
            messageType:'message-embed'
        },
        {
            cathegory:'main',
            name:'/хелп',
            functionName:'f_doCommand(17)',
            descr:'подивитися список команд і їх короткий опис; команди розділені на категорії, аналогічні яким представлені на даному сайті',
            msgInput:'/хелп',
            msgOutput:'Ви встановили нову кількість няшності, після якої видається роль Toxic і Meganyash = 100',
            params:[],
            buttons:[],
            details:'<b>Що може RhombitruncatedIcosidodecahedron?</b><br>'
                    +'/хелп інфо - загальні команди, всяке різне<br>'
                    +'/хелп фан - висловіть свою реакцію яскравою гіфкою<br>'
                    +'/хелп дії - подивіться, що можна зробити з іншими користувачами<br>'
                    +'/хелп економіка - зайчатки економіки бота<br>'
                    +'/хелп ігри - список ігр із ботом і юзерами'
                    +'/хелп адмін - команди для адмінів з налаштування бота та адміністрування сервера<br>'
                    +'/хелп<br>'
                    +'Автор бота - FlySquirrel (діскорд - .flysquirr)',
            messageType:'message-embed'
        },
        {
            cathegory:'admin',
            name:'/сервер',
            functionName:'f_doCommand(18)',
            descr:'виводить інформацію про сервер; адміністратори серверу можуть також бачити значення параметрів бота на даному сервері, доступних до редагування',
            msgInput:'/сервер',
            msgOutput:'<div style="float:right"><img src="indexfon.jpg" style="width:120px; height:120px"/></div>'
            +'<b>´°۩๑ Інформація про сервер 13th Avenue</b>\n'
            +'<b>Назва сервера</b>\n'
            +'13th Avenue\n'
            +'<b>Створення сервера</b>\n'
            +'Sat May 24 2025\n'
            +'<b>Ви приєдналися до сервера</b>\n'
            +'Sat May 24 2025\n'
            +'<b>Кількість учасників</b>\n'
            +'3\n'
            +'<b>Локаль</b>\n'
            +'uk\n'
            +'/сервер',
            params:[],
            buttons:[],
            details:'Поля, видимі адміністраторам, можуть мати приблизно наступний вигляд:<br><br>'
                    +'‿୨l║l° ﹤ ВІТАННЯ ﹥ °l║l୧‿<br>'
                    +'▶️ Id канала, де бот вітає нових користувачів = 1375947128815222946 (║-основний)<br>'
                    +'▶️ Вітати нових користувачів (true) або не вітати (false) = true<br>'
                    +'▶️ Вітальне повідомлення:<br>'
                    +'ну привіт, {member}<br><br>'
                    +'‿୨l║l° ﹤ ЕКОНОМІКА ﹥ °l║l୧‿<br>'
                    +'▶️ Кількість слів, еквівалентна 1 ⊤₵ (текстовому коїну) = 1 слів<br>'
                    +'▶️ Кількість мілісекунд, еквівалентна 1 V₵ (голосовому коїну) = 60000 мс<br>'
                    +'▶️ Мінімальна кількість коінів, яку можна передавати іншим користувачам = 50<br>'
                    +'▶️ Максимальна кількість коїнів, яку можна передавати іншим користувачам = 100<br>'
                    +'▶️ Максимальна кількість предметів в інвертарі = 50<br>'
                    +'▶️ Кількість покупних ролей, які може мати один користувач = 5<br><br>'
                    +'‿୨l║l° ﹤ КАРМА И НЯШНІСТЬ ﹥ °l║l୧‿<br>'
                    +'▶️ Кількість карми, після якої видається роль Good Karma и Bad Karma = 100 карми<br>'
                    +'▶️ Кількість няшності, після якої видається роль Toxic и Meganyash = 100 няшності<br>'
                    +'▶️ Скільки разів на день користувач може змінювати карму та няшність = 10 раз/день<br><br>'
                    +'‿୨l║l° ﹤ РОЛІ ﹥ °l║l୧‿<br>'
                    +'▶️ Видавати спеціальну роль новим користувачам (true) або не видавати (false) = false<br>'
                    +'▶️ Видавати спеціальну роль новим ботам (true) або не видавати (false) = false<br>'
                    +'▶️ Видавати ролі за кількість текстових повідомлень (true) чи не видавати (false) = true<br>'
                    +'▶️ Кількість ролей для зміни кольору ніка, що видаються за реакцією = 7<br>'
                    +'▶️ Видавати роль Good Karma та Bad Karma після досягнення рівня (true) або не видавати (false) = true<br>'
                    +'▶️ Видавати роль Toxic та Meganyash після досягнення рівня (true) або не видавати (false) = true<br><br>'
                    +'‿୨l║l° ﹤ ІНШЕ ﹥ °l║l୧‿<br>'
                    +'▶️ Мова бота = ua<br>'
                    +'▶️ Колір вертикальної смужки Embed-повідомлень = #BC2C52<br>'
                    +'▶️ Надсилати службові повідомлення та логи (додавання/видалення ролей, учасників, їх ролей, інформація про бани, мути та варни) в спеціальний канал = true<br>'
                    +'▶️ Id каналу, куди бот відправляє службові повідомлення = 1375946926784118834 (logs)<br>'
                    +'▶️ Кількість слів, після якої бот відповідає автору повідомлення рандомну фразу = 500 слів',
            messageType:'message-embed'
        },
        {
            cathegory:'admin',
            name:'/сервер задати',
            functionName:'f_doCommand(19)',
            descr:'використовується для керування привітаннями, авторолями, економікою, кармою і няшністю, логами та іншими параметрами бота, доступними до редагування',
            msgInput:'/сервер',
            msgOutput:'Ви встановили нову кількість няшності, після якої видається роль Toxic і Meganyash = 100',
            params:[{
                    name:'задати',
                    value:'True'
                },
                {
                    name:'тип',
                    value:'charminglvl'
                },
                {
                    name:'значення',
                    value:'100'
                }],
            buttons:[],
            details:'Якщо ввести лише параметр "задати" без "тип" і "значення", то виведеться список параметрів і значення, які вони приймають:<br>'
            +'<b>´°۩๑ Для редагування доступні наступні параметри</b><br>'
            +'‿୨l║l° ﹤ ПРИВІТАННЯ ﹥ °l║l୧‿<br>'
            +'▶️/сервер задати <dfn>greteengsChannelId</dfn> - Id канала, де бот вітає нових користувачів<br>'
            +'За замовчуванням - той, із якого бот зчитав перше повідомлення,<br>'
            +'▶️/сервер задати <dfn>doGreteengs</dfn> - вітати нових користувачів (1) чи не вітати (0)<br>'
            +'За замовчуванням 1,<br>'
            +'▶️/сервер задати <dfn>giveGreteengsRoles</dfn> - видавати роль новим учасникам (1) чи не видавати (0) (див. /ролі перелік)<br>'
            +'За замовчуванням 1,<br>'
            +'▶️/сервер задати <dfn>giveGreteengsRolesBot</dfn> - видавати роль новим ботам (1) чи не видавати (0) (див. /ролі перелік)<br>'
            +'За замовчуванням 1,<br>'
            +'▶️/сервер задати <dfn>greteengsMessage</dfn> - текст повідомлення новим учасникам сервера<br>'
            +'За замовчуванням "ну привіт, {member}",<br><br>'
            +'‿୨l║l° ﹤ ЕКОНОМІКА ﹥ °l║l୧‿<br>'
            +'▶️/сервер задати <dfn>textCoin</dfn> - кількість слів, еквівалентна 1 ⊤₵ (текстовому коїну).<br>'
            +'За замовчуванням 1 ⊤₵ = 1 слово.,<br>'
            +'▶️/сервер задати <dfn>voiceCoin</dfn> - кількість мілісекунд, еквівалнентних 1 V₵ (голосовому коїну).<br>'
            +'За замовчуванням 1 V₵ = 180000 мс (3 хвилини),<br>'
            +'▶️/сервер задати <dfn>minTransaction</dfn> - мінімальна кількість коїнів, яку можна передавати іншим користувачам<br>'
            +'За замовчуванням 50,<br>'
            +'▶️/сервер задати <dfn>maxTransaction</dfn> - максимальна кількість коїнів, яку можна передавати іншим користувачам<br>'
            +'За замовчуванням 100,<br>'
            +'▶️/сервер задати <dfn>itemCount</dfn> - максимальна кількість предметів в інвентарі<br>'
            +'За замовчуванням 50,<br><br>'
            +'‿୨l║l° ﹤ КАРМА І НЯШНІСТЬ ﹥ °l║l୧‿<br>'
            +'▶️/сервер задати <dfn>karmalvl</dfn> - кількість карми, після якої видається роль Good Karma и Bad Karma<br>'
            +'За замовчуванням 100 кармы,<br>'
            +'▶️/сервер задати <dfn>charminglvl</dfn> - кількість няшності, після якої видається роль Toxic и Meganyash<br>'
            +'За замовчуванням 100 няшності,<br>'
            +'▶️/сервер задати <dfn>votelim</dfn> - скільки разів на день користувач може змінювати карму та няшність<br>'
            +'За замовчуванням 10 раз,<br><br>'
            +'‿୨l║l° ﹤ РОЛІ ﹥ °l║l୧‿<br>'
            +'▶️/сервер задати <dfn>rankedRoles</dfn> - видавати ролі за кількість текстових повідомлень / хвилин у войсі (1) чи не видавати (0)<br>'
            +'За замовчуванням 1 - видавати (за к-кість повідомлень, налаштувати можна в /ролі),<br>'
            +'▶️/сервер задати <dfn>karmarole</dfn> - видавати роль Good Karma і Bad Karma після досягнення рівня (1) чи не видавати (0)<br>'
            +'За замовчуванням 1 - видавати,<br>'
            +'▶️/сервер задати <dfn>charmingrole</dfn> - выдавати роль Toxic і Meganyash після досягнення рівня (1) чи не видавати (0)<br>'
            +'За замовчуванням 1 - видавати,<br>'
            +'▶️/сервер задати <dfn>nikColorCount</dfn> - кількість ролей для зміни кольору ніка, що видаються за реакцією (ролі можна налаштувати в /ролі)<br>'
            +'За замовчуванням 7,<br>'
            +'▶️/сервер задати <dfn>rolesProUser</dfn> - скільки покупних ролей може мати один користувач<br>'
            +'За замовчуванням 5,<br><br>'
            +'‿୨l║l° ﹤ ІНШЕ ﹥ °l║l୧‿<br>'
            +'▶️/сервер задати <dfn>language</dfn> - вибрати мову бота: ua (українська) чи ru(російська)<br>'
            +'За замовчуванням - мова серверу, якщо вона укр. або рос., або українська,<br>'
            +'▶️/сервер задати <dfn>triggertime</dfn> - кількість слів, після якого бот відповідає автору повідомлення рандомну фразу<br>'
            +'За замовчуванням 500 слiв,<br>'
            +'▶️/сервер задати <dfn>embedColor</dfn> - задати колір вертикальної полоски Embed-повідомлень (в HEX-форматі але без решітки, наприклад чорний - 000000)<br>'
            +'За замовчуванням - #BC2C52,<br>'
            +'▶️/сервер задати <dfn>doLogs</dfn> - надсилати службові повідомлення та логи (додавання/видалення ролей, учасників, їх ролей, інформація про бани, мути та варни) в спеціальний канал (1) чи не відправляти (0)<br>'
            +'За замовчуванням 1 - відправляти<br>'
            +'▶️/сервер задати <dfn>updatesChannelId</dfn> - Id канала, куди бот надсилає службові повідомлення<br>'
            +'За замовчуванням - той, звідки бот зчитав перше повідомлення',
            messageType:'message-text'
        },
        {
            cathegory:'admin',
            name:'/ролі перелік',
            functionName:'f_doCommand(20)',
            descr:'переглянути параметри ролей в базі бота, які можна налаштувати',
            msgInput:'/ролі',
            msgOutput:'<b>´°۩๑ Для редагування доступні наступні параметри</b><br>'
                +'Щоб змінити параметр введіть:<br>'
                +'/ролі змінити [індекс] [параметр: ім\'я / колір / реакція / к-кість / що-рахувати] [нове значення]<br><br>'
                +'<b>🙋 Ролі для видачі новим користувачам[ Індекс ]◾[ Ім\'я ]◾[ колір ]</b><br>'
                +'[ 20 ]◾[ - 🐇 фауна - ]◾[ DEFAULT ]<br>'
                +'[ 21 ]◾[ - 🍀 флора - ]◾[ DEFAULT ]<br><br>'
                +'<b>🥇При досягненні рівня видаватимуться наступні ролі:<br>'
                +'[ Індекс ]◾[ Ім\'я ]◾[ колір ]◾[ к-кість ]◾[ що-рахувати ]</b><br>'
                +'[ 15 ]◾[ |♟ гість | ]◾[ #7c55ff ]◾[ 1000 ]◾[ messages ]<br>'
                +'[ 16 ]◾[ |♞ постоялець | ]◾[ #cf53ff ]◾[ 2000 ]◾[ messages ]<br>'
                +'[ 17 ]◾[ |♜ житель | ]◾[ #fd4f7d ]◾[ 3000 ]◾[ messages ]<br>'
                +'[ 18 ]◾[ |♝ місцевий | ]◾[ #E67E22 ]◾[ 4000 ]◾[ messages ]<br>'
                +'[ 19 ]◾[ |♚ свій | ]◾[ #C79C30 ]◾[ 5000 ]◾[ messages ]<br><br>'
                +'<b>🎨 При видачі ролі по реакції видаватимуться наступні ролі:<br>'
                +'[ Індекс ]◾[ Ім\'я ]◾[ колір ]◾[ реакція ]</b><br>'
                +'[ 3 ]◾[ nikColor1 ]◾[ #ff43a1 ]◾[ 💖 ]<br>'
                +'[ 4 ]◾[ nikColor2 ]◾[ #1ad1b7 ]◾[ 🍭 ]<br>'
                +'[ 5 ]◾[ nikColor3 ]◾[ #9c66ec ]◾[ 💜 ]<br>'
                +'[ 6 ]◾[ nikColor4 ]◾[ #eeaf9d ]◾[ 💗 ]<br>'
                +'[ 7 ]◾[ nikColor5 ]◾[ #27e75f ]◾[ 💚 ]<br>'
                +'[ 8 ]◾[ nikColor6 ]◾[ #c4c3c3 ]◾[ 🤍 ]<br>'
                +'[ 9 ]◾[ nikColor7 ]◾[ #599ebe ]◾[ 💙 ]<br><br>'
                +'<b>💸 Доступні наступні покупні ролі:<br>'
                +'[ Індекс ]◾[ Ім\'я ]◾[ колір ]◾[ к-кість ]◾[ що-рахувати ]</b><br>'
                +'[ 10 ]◾[ - ♨ Бариста - ]◾[ #EB857D ]◾[ 1000 ]◾[ вс ]<br>'
                +'[ 11 ]◾[ - 🗿 Каменяр - ]◾[ #7CACE4 ]◾[ 1000 ]◾[ тс ]<br>'
                +'[ 12 ]◾[ - 🥄 Копач - ]◾[ #ff3922 ]◾[ 2000 ]◾[ тс ]<br>'
                +'[ 22 ]◾[ -🞂🞂|🚘 Гонщик |🞂🞂- ]◾[ #ff5a00 ]◾[ 1000 ]◾[ вс ]<br>'
                +'[ 23 ]◾[ - Ремесленик (•̀ᴗ•́)و ̑̑ - ]◾[ #00908c ]◾[ 5000 ]◾[ вс ]<br><br>'
                +'<b>🎮 Доступні нступні ролі, що видаються за ігри:<br>'
                +'[ Індекс ]◾[ Ім\'я ]◾[ колір ]◾[ назва гри ]</b><br><br>'
                +'/ролі перелік',
            params:[{
                    name:'перелік-або-змінити',
                    value:'перелік'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'admin',
            name:'/ролі змінити',
            functionName:'f_doCommand(21)',
            descr:'використовується для редагування параметрів ролей, перелічених у /ролі перелік',
            msgInput:'/ролі',
            msgOutput:'Нові параметри ролі: ім\'я = transparent, колір = #c4c3c3, реакція = 🤍.<br>'
                    +'<i>Налаштуйте позицію ролі в налаштуваннях сервера => Ролі</i>',
            params:[{
                    name:'перелік-або-змінити',
                    value:'змінити'
                },
                {
                    name:'індекс',
                    value:'8'
                },
                {
                    name:'назва',
                    value:'transparent'
                }],
            buttons:[],
            details:'➤ Для редагування після вибору параметру "змінити" обов\'язково вказати індекс ролі, приведений у /ролі перелік, '
                    +'після чого можете вибрати один або декілька параметрів для редагування, доступних для даної ролі<br>'
                    +'➤ ВАЖЛИВО змінювати назву та колір ролі саме через цю команду, бо інакше вони можуть не коректно працювати, а мені впадлу ставити захист від дурака<br>'
                    +'➤ Також при редагуванні ролей створюється лог у випадку, якщо адміністратор серверу налаштує логування',
            messageType:'message-text'
        },
        {
            cathegory:'admin',
            name:'/роль-за-гру [найменування гри] [найменування ролі] [колір]',
            functionName:'f_doCommand(22)',
            descr:'використовується для створення ролі, яка буде автоматично видаватися користувачам серверу при запуску вказаної гри',
            msgInput:'/роль-за-гру',
            msgOutput:'Для гри Cube Escape Collection успішно створена роль <em>@CuBe EsCaPe CoLleCtiOn!</em><br>'
                    +'Змінити параметри ролі можна в /ролі змінити',
            params:[{
                    name:'назва-гри',
                    value:'Cube Escape Collection'
                },
                {
                    name:'назва-ролі',
                    value:'CuBe EsCaPe CoLleCtiOn'
                },
                {
                    name:'колір',
                    value:'default'
                }],
            buttons:[],
            details:'➤ Після створення роль доступна для редагування у /ролі перелік.<br>'
                    +'➤ Щоб відмінити видачу даної ролі, можете просто змінити назву гри у /ролі змінити.<br>'
                    +'➤ Значення кольору default означає "прозорий колір"<br>'
                    +'➤ Кількість ролей необмежена<br>'
                    +'➤ Також при створенні нових ролей створюється лог у випадку, якщо адміністратор серверу налаштує логування',
            messageType:'message-text'
        },
        {
            cathegory:'admin',
            name:'/колірніка',
            functionName:'f_doCommand(23)',
            descr:'використовується для створення повідомлення із реакціями, по натисканням на які буде видаватися роль',
            msgInput:'/колірніка',
            msgOutput:'💢 Натисніть на реакцію, щоб отримати роль<br>'
                        +'💖 - @nikColor1<br>'
                        +'🍭 - @nikColor2<br>'
                        +'💜 - @nikColor3<br>'
                        +'💗 - @nikColor4<br>'
                        +'💚 - @nikColor5<br>'
                        +'🤍 - @nikColor6<br>'
                        +'💙 - @nikColor7',
            params:[],
            buttons:['💖', '🍭', '💜', '💗', '💚', '🤍', '💙'],
            details:'➤ Доступно 7 ролей, якщо треба більше, звертайтеся, оформимо вам скільки треба.<br>'
            +'➤ Ви можете зменшити кількість ролей за реакцію у /сервер задати тип:nikColorCount значення:<br>'
            +'➤ Назва і колір ролі, а також емодзі реакції можна змінити у /ролі змінити<br>'
            +'➤ Якщо ролей ще немає на сервері, вони будуть створені автоматично при виклику команди<br>'
            +'➤ Також при створенні нових ролей створюється лог у випадку, якщо адміністратор серверу налаштує логування',
            messageType:'message-text'
        },
        {
            cathegory:'admin',
            name:'/мут',
            functionName:'f_doCommand(24)',
            descr:'замутити користувача: користувачу видається роль, яка забороняє йому писати в чати і говорити у войсах',
            msgInput:'/мут',
            msgOutput:'🔇 Користувач FlySquirrel був замучений по причині: балується',
            params:[{
                    name:'user',
                    value:'FlySquirrel'
                },
                {
                    name:'причина',
                    value:'балується'
                },
                {
                    name:'тривалість',
                    value:'60'
                }],
            buttons:[],
            details:'➤ Можна задати тривалість муту, а можна не задавати: тоді розмучення користувача модератори мають здійснювати вручну<br>'
            +'➤ Мут буде записаний в досьє користувача разом із тим, хто видав, датою і причиною видачі.<br>'
            +'➤ Мути зберігаються навіть після того, як користувач покине сервер: так у випадку, якщо він повторно зайде на сервер, в досьє уже буде інформація про його попереднє перебування на сервері<br>'
            +'➤ Також для муту створюється лог у випадку, якщо адміністратор серверу налаштує логування',
            messageType:'message-text'
        },
        {
            cathegory:'admin',
            name:'/розмутити',
            functionName:'f_doCommand(25)',
            descr:'зняти мут вручну, для тих, кому лінь видаляти у користувача роль муту вручну',
            msgInput:'/розмутити',
            msgOutput:'🔊 Користувач FlySquirrel був розмучений!',
            params:[{
                    name:'user',
                    value:'FlySquirrel'
                }],
            buttons:[],
            details:'',
            messageType:'message-text'
        },
        {
            cathegory:'admin',
            name:'/варн',
            functionName:'f_doCommand(26)',
            descr:'по суті являє собою запис у досьє користувача і може бути використано, наприклад, на суді',
            msgInput:'/варн',
            msgOutput:'⚠️ Користувачеві FlySquirrel було видано попередження.<br>Причина: <i>балується</i>',
            params:[{
                    name:'user',
                    value:'FlySquirrel'
                },
                {
                    name:'причина',
                    value:'балується'
                }],
            buttons:[],
            details:'➤ Варн буде записаний в досьє користувача разом із тим, хто видав, датою і причиною видачі.<br>'
            +'➤ Варни зберігаються навіть після того, як користувач покине сервер: так у випадку, якщо він повторно зайде на сервер, в досьє уже буде інформація про його попереднє перебування на сервері<br>'
            +'➤ Також для варну створюється лог у випадку, якщо адміністратор серверу налаштує логування',
            messageType:'message-text'
        },
        {
            cathegory:'admin',
            name:'/бан',
            functionName:'f_doCommand(27)',
            descr:'видача бану користувачеві: його повідомлення будуть видалені із серверу після 7-ми днів бану',
            msgInput:'/бан',
            msgOutput:'⛔ Користувач FlySquirrel був забанений.<br> Причина: <i>балується</i>',
            params:[{
                    name:'user',
                    value:'FlySquirrel'
                },
                {
                    name:'причина',
                    value:'балується'
                }],
            buttons:[],
            details:'➤ Бан буде записаний в досьє користувача разом із тим, хто видав, датою і причиною видачі.<br>'
            +'➤ Бани зберігаються навіть після того, як користувач покине сервер: так у випадку, якщо він повторно зайде на сервер, в досьє уже буде інформація про його попереднє перебування на сервері<br>'
            +'➤ Також для бану створюється лог у випадку, якщо адміністратор серверу налаштує логування',
            messageType:'message-text'
        },
        {
            cathegory:'admin',
            name:'/блітцбан',
            functionName:'f_doCommand(28)',
            descr:'видача бану користувачеві: його повідомлення будуть МИТТЄВО видалені із серверу',
            msgInput:'/блітцбан',
            msgOutput:'⛔ Користувач FlySquirrel був забанений.<br> Причина: <i>балується</i>',
            params:[{
                    name:'user',
                    value:'FlySquirrel'
                },
                {
                    name:'причина',
                    value:'балується'
                }],
            buttons:[],
            details:'➤ Бан буде записаний в досьє користувача разом із тим, хто видав, датою і причиною видачі.<br>'
            +'➤ Бани зберігаються навіть після того, як користувач покине сервер: так у випадку, якщо він повторно зайде на сервер, в досьє уже буде інформація про його попереднє перебування на сервері<br>'
            +'➤ Також для бану створюється лог у випадку, якщо адміністратор серверу налаштує логування',
            messageType:'message-text'
        },
        {
            cathegory:'admin',
            name:'/розбанити',
            functionName:'f_doCommand(29)',
            descr:'розбанити користувача: команда для тих, кому впадлу лізти у налаштування серверу і витягувати користувача із бану вручну',
            msgInput:'/розбанити',
            msgOutput:'🏳️ Користувач 6942672048643886289 розбанений!',
            params:[{
                    name:'user',
                    value:'FlySquirrel'
                }],
            buttons:[],
            details:'',
            messageType:'message-text'
        },
        {
            cathegory:'admin',
            name:'/перевірити username/user id',
            functionName:'f_doCommand(30)',
            descr:'аналог команди /досьє для тих, хто покинув сервер: дозволяє подивитися список банів, мутів, варнів, а також дізнатися, яким чином користувач покинув сервер',
            msgInput:'/перевірити',
            msgOutput:'<b>Дані користувача 6942672048643886289</b><br>'
                    +'⛔ Список банів<br>'
                    +'5 чер 2025р. 12:5 - балується (виданий IAmJusice)<br>'
                    +'⚠️ Список варнів<br>'
                    +'--- відсутні ---<br>'
                    +'🔇 Список мутів<br>'
                    +'--- відсутні ---<br>'
                    +'Схоже, користувач FlySquirrel був нещадно забанений RhombitruncatedIcosidodecahedron#5272 05.06.2025 12:05 по причині: балується<br>'
                    +'/перевірити 6942672048643886289',
            params:[{
                    name:'користувач',
                    value:'6942672048643886289'
                }],
            buttons:[],
            details:'Можна шукати користувача як по id так і по ніку',
            messageType:'message-embed'
        },
        {
            cathegory:'admin',
            name:'/клін N',
            functionName:'f_doCommand(31)',
            descr:'почистити задану кількість N останніх повідомлень в чаті (до 100), якщо вони там знаходяться не довше 14 днів',
            msgInput:'/клін',
            msgOutput:'🧹 Видалено 69 повідомлень.',
            params:[{
                    name:'кількість',
                    value:'69'
                }],
            buttons:[],
            details:'',
            messageType:'message-text'
        },
        {
            cathegory:'economics',
            name:'/купити',
            functionName:'f_doCommand(32)',
            descr:'переглянути товари в магазині: ролі, предмети для ролей, скіни для /профіль. Все купляється за текстові або войсові коїни',
            msgInput:'',
            msgOutput:'<b>💰Ви можете придбати одну з наступних ролей💰</b><br>'
                +'<b style="color: #eb857d; background-color:rgba(235, 132, 125, 0.2); border-radius:5px; padding:2px">@- ♨ Бариста -</b> - може робити каву користувачам<br>'
                +'/купити роль:бариста = 1000 V₵<br><br>'
                +'<b style="color: #7cace4; background-color:rgba(124, 173, 228, 0.2); border-radius:5px; padding:2px">@- 🗿 Каменяр -</b> - може працювати, іноді без зарплати<br>'
                +'/купити роль:камінщик = 1000 Т₵<br><br>'
                +'<b style="color: #ff3922; background-color:rgba(255, 56, 34, 0.2); border-radius:5px; padding:2px">@- 🥄 Копач -</b> - може копати ямку<br>'
                +'/купити роль:копач = 2000 Т₵<br><br>'
                +'<b style="color: #ff5a00; background-color:rgba(255, 89, 0, 0.2); border-radius:5px; padding:2px">@-🞂🞂|🚘 Гонщик |🞂🞂-</b> - може брати участь у перегонах<br>'
                +'/купити роль:гонщик = 1000 V₵<br><br>'
                +'<b style="color: #00908c; background-color:rgba(0, 144, 139, 0.2); border-radius:5px; padding:2px">@- Ремесленик (•̀ᴗ•́)و ̑̑ -</b> - може крафтити предмети в інвентар користувачів<br>'
                +'/купити роль:ремесленик = 5000 V₵<br><br>'
                +'/економіика <назва ролі> - переглянути команди для даних ролей<br>'
                +'/купити',
            params:[],
            buttons:['Ролі', 'Предмети', 'Скіни'],
            details:'➤ При виклику команди на сервері автоматично будуть створені ролі, якщо до цього їх не було на сервері<br>'
                    +'➤ Ви можете змінити назву ролі, колір і ціну в /ролі задати. У /сервер задати параметр: ви можете задати, скільки покупних ролей максимум може мати один користувач<br>'
                    +'➤ Також при створенні нових створюється лог у випадку, якщо адміністратор серверу налаштує логування<br><br>'
                    +'<b>Із предметів для покупки доступні:</b><br> - інструменти для копача, які допомагають копати ямку глибше (лопата, рентгеновські окуляри і екскаватор)<br>'
                    +'- машини для гонщика, на яких можна проїхати більше км в день (Део Ланус, Таксі 2, Блискавка Мак Квін, Бетмобіль)<br><br>'
                    +'У скінах можна придбати інші варіанти прикрашання профілю текстовими символами, емодзі перед і після імені, а також встановити аватар, який буде відрізнятися від аватару в Діскорді',
            messageType:'message-embed'
        },
        {
            cathegory:'economics',
            name:'/купити емодзі-до &lt;a:c9:1373380823188770916&gt;',
            functionName:'f_doCommand(33)',
            descr:'приклад використання команди для здійснення покупки',
            msgInput:'/купити',
            msgOutput:'<em>@FlySquirrel</em>, вітаю, ви придбали емодзі для профілю сервера!',
            params:[{
                    name:'скін',
                    value:'емодзі-до'
                },
                {
                    name:'параметр',
                    value:'&lt;a:c9:1373380823188770916&gt;'
                }],
            buttons:[],
            details:'',
            messageType:'message-text-mentioned'
        },
        {
            cathegory:'economics',
            name:'/економіка',
            functionName:'f_doCommand(34)',
            descr:'переглянути можливості, які надає покупна роль (точніше, команди, до яких вона надає доступ)',
            msgInput:'/економіка',
            msgOutput:'<b>- ♨ Бариста -</b><br>'
                    +'може робити каву або шмурдяк користувачам<br>'
                    +'/зробити каву @user - зробити каву user\'у<br>'
                    +'/зробити шмурдяк @user - зробити шмурдяк user\'у<br>'
                    +'/випити каву - випивши кофе, юзера може вштирити від 0 до 100%<br>/випити шмурдяк - випивши шмурдяк, юзер отримує -1 няшності<br>'
                    +'/економіка бариста',
            params:[{
                    name:'найменування',
                    value:'бариста'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'economics',
            name:'/передати тс @user сума',
            functionName:'f_doCommand(35)',
            descr:'передати user-у текстові коїни (⊤₵ або тс)',
            msgInput:'/передати',
            msgOutput:'<em>@FlySquirrel</em> передав(ла) <em>@RhombitruncatedIcosidodecahedron</em> 100 Т₵',
            params:[{
                    name:'валюта',
                    value:'тс'
                },
                {
                    name:'user',
                    value:'Rhombitruncatedicosidodecahedron'
                },
                {
                    name:'сума',
                    value:'100'
                },],
            buttons:[],
            details:'аналогічним чином можна передати войсові коїни (V₵ або вс)',
            messageType:'message-text-mentioned'
        },
        {
            cathegory:'economics',
            name:'/звільнитися бариста',
            functionName:'f_doCommand(36)',
            descr:'видалити у себе покупну роль',
            msgInput:'/звільнитися',
            msgOutput:'<em>@FlySquirrel</em>, ви більше не - ♨ Бариста - і вільні як вітер в полі!',
            params:[{
                    name:'роль',
                    value:'бариста'
                }],
            buttons:[],
            details:'',
            messageType:'message-text-mentioned'
        },
        {
            cathegory:'economics',
            name:'/випити каву',
            functionName:'f_doCommand(37)',
            descr:'команду може застосовувати будь-який користувач, якому бариста зробив каву',
            msgInput:'/випити',
            msgOutput:'<em>@FlySquirrel</em> випив(ла) каву і його(її) вштирило на 41%',
            params:[{
                    name:'що-випити',
                    value:'каву'
                }],
            buttons:[],
            details:'',
            messageType:'message-text-mentioned'
        },
        {
            cathegory:'economics',
            name:'/копати',
            functionName:'f_doCommand(38)',
            descr:'команда доступна для ролі Копач 1 раз на 24 години',
            msgInput:'/копати',
            msgOutput:'☁️☁️☁️☁️☁️☁️☁️<br>'
                        +'🌳⍋&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;*̡̡:🏠 🌳 ⍋🌳<br>'
                        +'&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;|&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;|<br>'
                        +'&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;|&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;|<br>'
                        +'&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;| ⛏️ |<br>'
                        +'Копач <em>@FlySquirrel</em> в цей день викопав яму на 3 м глибше',
            params:[],
            buttons:[],
            details:'',
            messageType:'message-text-mentioned'
        },
        {
            cathegory:'economics',
            name:'/заїзд',
            functionName:'f_doCommand(39)',
            descr:'команда доступна для ролі Гонщик 1 раз на 24 години',
            msgInput:'/заїзд',
            msgOutput:'﹍﹍﹍﹍﹍﹍﹍﹍💨🚲.<br>'
                    +'Сьогодні <em>@FlySquirrel</em> проїхав 99 км.<br>'
                    +'До фініша залишилося 823 км.',
            params:[],
            buttons:[],
            details:'',
            messageType:'message-text-mentioned'
        },
        {
            cathegory:'economics',
            name:'/виготовити',
            functionName:'f_doCommand(40)',
            descr:'команда доступна для ролі Ремесленик 10 раз на 24 години',
            msgInput:'/виготовити',
            msgOutput:'<em>@FlySquirrel</em>, у вас новий предмет в инвентарі - компухтер :rpc:!',
            params:[{
                    name:'предмет-або-перелік',
                    value:'предмет'
                },
                {
                    name:'найменування',
                    value:'компухтер'
                },
                {
                    name:'емодзі',
                    value:'&lt;a:rpc:1373288176537309234&gt;'
                },
                {
                    name:'user',
                    value:'FlySquirrel'
                },
                {
                    name:'опис',
                    value:'вінтаж все ще в моді'
                },],
            buttons:[],
            details:'всі виготовлені предмети відображаються в інвентарі користувача разом із назвою, описом і тим, хто виготовив;<br>'
                    +' емодзі предмета відображається у профілі;<br>опис - не обов\'язковий параметр',
            messageType:'message-text-mentioned'
        },
        {
            cathegory:'economics',
            name:'/виготовити перелік',
            functionName:'f_doCommand(41)',
            descr:'тут можна вибрати користувацькі емодзі бота, які можна використати для виготовлення',
            msgInput:'/виготовити',
            msgOutput:'*повідомлення видиме лише автору команди*',
            params:[{
                    name:'предмет-або-перелік',
                    value:'перелік'
                }],
            buttons:[],
            details:'',
            messageType:'message-text'
        },
        {
            cathegory:'economics',
            name:'/зробити',
            functionName:'f_doCommand(42)',
            descr:'команда доступна для ролі Бариста 1 раз на 10 хвилин',
            msgInput:'/зробити',
            msgOutput:'<div style="float:right"><img src="https://i.ibb.co/3YhDP1CW/coffee-4.gif" width="100px"/></div>'
                    +'<em>@RhombitruncatedIcosidodecahedron</em>, у вас 1 ☕<br>'
                    +'Введіть /випити каву доки вона ще гаряча!',
            params:[{
                    name:'що-зробити',
                    value:'каву'
                },
                {
                    name:'user',
                    value:'Rhombitruncatedicosidodecahedron'
                }],
            buttons:[],
            details:'аналогічна команда для шмурдяка',
            messageType:'message-embed'
        },
        {
            cathegory:'games',
            name:'/зомбі',
            functionName:'f_doCommand(43)',
            descr:'почати гру "Зомбі"',
            msgInput:'/зомбі',
            msgOutput:'⊹⊱⋛📢 Набір на гру "Зомбі!" 📢⋚⊰⊹<br>'
                    +'Натисніть на 🧟 до початку гри, щоб приєднатися<br>'
                    +'Гра почнеться через 3 хвилин.<br>'
                    +'Щоб грати, потрібно відкрити доступ до особистих повідомлень для бота.<br>'
                    +'🔺 - збільшити час очікування на 30 секунд;<br>'
                    +'🔻 - зменшити час очікування на 30 секунд;<br>'
                    +'* час буде змінено для наступних повідомлень<br>'
                    +'🔫 - почати гру зараз; 🔇 - відмінити набір',
            params:[],
            buttons:['🧟','🔫','🔺','🔻','🔇'],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'games',
            name:'/зомбі інфо',
            functionName:'f_doCommand(44)',
            descr:'подивитися, як грати у гру зомбі',
            msgInput:'/зомбі',
            msgOutput:'<b>⊱⋛⋋ Ласкаво просимо до Зомбітауну! ⋌⋚⊰</b><br>'
                    +'Це місто населене мирними жителями, але серед них блукають голодні зомбі, що полюють на їх мізки!<br>'
                    +'<br><b>Як грати в цю гру?</b><br>'
                    +'Мета гри: Мирні жителі 😇 повинні знищити всіх зомбі, щоб виграти.<br>'
                    +'Задача Зомбі 🧟 - захопити мізки всіх мирних жителів, щоб виграти.<br>'
                    +'■ <b>вночі</b> зомбі вибирають свою жертву, яка згодом зі ймовірністю 50% перетворюється на зомбі<br>'
                    +'■ <b>вдень</b> жителі міста обирають гравця, який буде страчений<br>'
                    +'Гра від 5-ти гравців<br><br>'
                    +'Автор - FlySquirrel',
            params:[{
                    name:'параметр',
                    value:'інфо'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'games',
            name:'/зомбі команди',
            functionName:'f_doCommand(45)',
            descr:'подивитися опис команд гри зомбі',
            msgInput:'/зомбі',
            msgOutput:'<b>⊹⊱⋛⋋ Команди бота ⋌⋚⊰⊹</b><br><br>'
                    +'/зомбі - почати гру "Зомбі"<br>'
                    +'/зомбі інфо - в чому сенс гри "Зомбі"<br>'
                    +'/зомбі ролі - перелік ролей<br>'
                    +'/зомбі стоп - завершити поточну гру "Зомбі", еквівалентно RESET<br>'
                    +'/зомбі вийти - покинути поточну гру<br>'
                    +'/зомбі час <число>` - задати тривалість дня і ночи (вводити до початку гри), де <число> - час у хвилинах (додатнє ціле)',
            params:[{
                    name:'параметр',
                    value:'команди'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'games',
            name:'/зомбі ролі',
            functionName:'f_doCommand(46)',
            descr:'подивитися, які ролі можуть попастися у грі зомбі',
            msgInput:'/зомбі',
            msgOutput:'<b>⊹⊱⋛⋋ Ролі гри ⋌⋚⊰⊹</b><br><br>'
                    +'■ Мирний житель 😇 повинні знищити всіх зомбі, щоб виграти. Можуть голосувати вдень кого стратити<br>'
                    +'■ Зомби 🧟 повинні захопити мізки всіх мирних жителів, щоб виграти. Можуть вибирати вночі, чий мозок з\'їсти<br><br>'
                    +'<b>Мирні ролі:</b><br>'
                    +'■ Мисливець на зомбів 🏹, який може вбити вночі зомбі чи мирного жителя<br>'
                    +'■ Детектив 🕵️, який може дізнатися вночі роль гравця',
            params:[{
                    name:'параметр',
                    value:'ролі'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'games',
            name:'/крокодил',
            functionName:'f_doCommand(47)',
            descr:'почати гру "Крокодил"',
            msgInput:'/крокодил',
            msgOutput:'<b>~ Гра "Крокодил" почалась! ~ 🐊</b><br><br>'
                    +'• Натисніть 💬, щоб загадати слово та введіть в особистому чаті з null слово<br>'
                    +'• Натисніть 🎱, щоб вибрати слово зі списку: бот надішле слово вам у ЛС<br>'
                    +'• Натисніть ❌, щоб скасувати гру<br>'
                    +'☞ Встигніть вибрати або загадати слово за 1 хвилину, інакше гра не почнеться!<br>'
                    +'/крокодил',
            params:[],
            buttons:['💬','🎱','❌'],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'games',
            name:'/крокодил інфо',
            functionName:'f_doCommand(48)',
            descr:'подивитися, як грати у гру крокодил',
            msgInput:'/крокодил',
            msgOutput:'<b>°۩๑ У чому прикол гри крокодил? ๑۩°</b><br><br>'
                    +'Гравець-ведучий загадує слово, а решта гравців намагається його відгадати.<br>'
                    +'Ведучий може давати різні підказки.<br>'
                    +'Гравець, який відгадав слово – переможець!<br><br>'
                    +'/крокодил - почати гру<br>'
                    +'/крокодил топ - переглянути топ 10 переможців<br>'
                    +'слово ваше-слово - загадати своє слово або змінити поточне в ЛС з ботом (доступно лише ведучому)<br><br>'
                    +'/крокодил інфо',
            params:[{
                    name:'параметр',
                    value:'інфо'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'games',
            name:'/крокодил топ',
            functionName:'f_doCommand(49)',
            descr:'подивитися топ 10 юзерів, які відгадали найбільше слів',
            msgInput:'/крокодил',
            msgOutput:'<b>~ 🐊 Топ гравців 13th Avenue ~ 🐊</b><br><br>'
                    +'1 FlySquirrel - [ 29 ] слів<br>'
                    +'2 User1 - [ 22 ] слів<br>'
                    +'3 User2 - [ 15 ] слів<br><br>'
                    +'/крокодил топ',
            params:[{
                    name:'параметр',
                    value:'топ'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'games',
            name:'/гриби',
            functionName:'f_doCommand(50)',
            descr:'почати гру "Гриби": під рослинами і листочками можна знайти гриб або іншу несподіванку',
            msgInput:'/гриби',
            msgOutput:'Встигни знайти всі гриби за хвилину і не померти!',
            params:[],
            buttons:['🌲','🍃','🌳','🍂','🌾','🌿','🌴'],
            details:'',
            messageType:'message-text'
        },
        {
            cathegory:'games',
            name:'/гриби топ',
            functionName:'f_doCommand(51)',
            descr:'подивитися топ 10 юзерів серверу, які зібрали найбільше грибів',
            msgInput:'/гриби',
            msgOutput:'<b>🍄🍄🍄 Топові грибники 13th Avenue 🍄🍄🍄</b><br><br>'
                    +'..｡o●1 FlySquirrel - 6 🍄<br>'
                    +'..｡o●2 RhombitruncatedIcosidodecahedron - 0 🍄<br>'
                    +'..｡o●3 User1 - 0 🍄<br><br>'
                    +'/гриби топ',
            params:[{
                    name:'топ',
                    value:'True'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'games',
            name:'/голосування',
            functionName:'f_doCommand(52)',
            descr:'генерує повідомлення із варіантами у вигляді кнопок',
            msgInput:'/голосування',
            msgOutput:'Голосування від FlySquirrel<br><br>'
                    +'Так чи ні?<br><br>'
                    +'Натисніть кнопку, щоб проголосувати',
            params:[{
                    name:'варіанти',
                    value:'Так, Ні'
                }],
            buttons:['Так','Ні','Завершити голосування'],
            details:'➤ Після виконання команди автор має протягом 30 секунд ввести текст голосування, потім натиснути "Відправити" - голосування буде згенероване.<br>'
                    +'➤ Після того, як автор голосування натисне "Завершити голосування", в чат виведеться повідомлення із результатами голосування.<br>'
                    +'➤ Якщо у варіанти ввести "інфо", бот відправить в чат інструкцію, як створювати голосування.',
            messageType:'message-embed'
        },
        {
            cathegory:'games',
            name:'/рулетка',
            functionName:'f_doCommand(53)',
            descr:'інформація, як грати у гру. Коротко: просто вводьте в чат вистріл',
            msgInput:'/рулетка',
            msgOutput:'У барабані 6 слотів, у одному з них куля. Кому випало 6 – програє. Гра від двох гравців, стріляти по черзі.<br><i>Команда:</i> вистріл',
            params:[],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'games',
            name:'/сказати',
            functionName:'f_doCommand(54)',
            descr:'сказати від імені бота',
            msgInput:'/сказати',
            msgOutput:'<em>@FlySquirrel</em> каже: ну типу',
            params:[{
                    name:'текст',
                    value:'ну типу'
                }],
            buttons:[],
            details:'',
            messageType:'message-text-mentioned'
        },
        {
            cathegory:'games',
            name:'/тест',
            functionName:'f_doCommand(55)',
            descr:'протестувати користувача',
            msgInput:'/тест',
            msgOutput:'<div style="float:right"><img src="/public/rhombimedia/flysqavatar.jpg"/></div>'
                    +'<b>Результат тестування</b><br><br>'
                    +'Об\'єкт: <em>@FlySquirrel</em><br>'
                    +'Досліджувана властивість: На геніальність<br>'
                    +'Результат: [ 93% ] 🔬',
            params:[{
                    name:'user',
                    value:'FlySquirrel'
                },
                {
                    name:'властивість',
                    value:'На геніальність'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'games',
            name:'/число А Б',
            functionName:'f_doCommand(56)',
            descr:'випадкове число в діапазоні А Б',
            msgInput:'/число 0 10',
            msgOutput:'<b>🎲 Випадкове число</b><br>'
                    +'Ваше число в діапазоні [0; 10]: <b>4</b>',
            params:[{
                    name:'від',
                    value:'0'
                },
                {
                    name:'до',
                    value:'10'
                }],
            buttons:[],
            details:'',
            messageType:'message-embed'
        },
        {
            cathegory:'games',
            name:'/шар запитання',
            functionName:'f_doCommand(57)',
            descr:'генерує відповідь на запитання',
            msgInput:'/шар',
            msgOutput:'звісно!',
            params:[{
                    name:'запитання',
                    value:'так чи ні?'
                }],
            buttons:[],
            details:'',
            messageType:'message-text'
        },
        {
            cathegory:'reactions',
            name:'/я-в-захваті',
            functionName:'f_doCommand(58)',
            descr:'',
            msgInput:'/я-в-захваті',
            msgOutput:'FlySquirrel в захваті<br>'
                    +'<img src="https://media.giphy.com/media/RvCqf3bkPhp4Y/giphy.gif"/><br>'
                    +'/я-в-захваті',
            params:[],
            buttons:[],
            details:'приклад формату повідомлення реакції<br>гіфка радномна',
            messageType:'message-embed'
        },
        {
            cathegory:'dowith',
            name:'/тиць',
            functionName:'f_doCommand(59)',
            descr:'',
            msgInput:'/тиць',
            msgOutput:'<em>@FlySquirrel</em> тицьнув(ла) <em>@RhombitruncatedIcosidodecahedron</em><br>'
                    +'<img src="https://i.ibb.co/BZvPkQ7/poke2.gif" width="400px"/><br>'
                    +'/тиць @user',
            params:[{
                    name:'user',
                    value:'Rhombitruncatedicosidodecahedron'
                }],
            buttons:[],
            details:'приклад формату реакції-дії з користувачем<br>гіфка рандомна<br>якщо не вказати користувача, то дія буде зроблена самим із собою',
            messageType:'message-embed'
        },
        {
            cathegory:'dowith',
            name:'/пара-дня',
            functionName:'f_doCommand(60)',
            descr:'вибирає рвндомну пару дня із користувачів серверу',
            msgInput:'/пара-дня',
            msgOutput:'Пара дня: @User1 + @User2 = 💕 Це так мило!<br>'
                    +'<img src="https://i.ibb.co/51HyWVw/mochi-cat.gif" width="400px"/><br>'
                    +'/пара-дня',
            params:[],
            buttons:[],
            details:'можна вибирати 1 раз в 24 години<br>вибрані юзери отримують +1 до няшності',
            messageType:'message-embed'
        },
        {
            cathegory:'dowith',
            name:'/замути мем',
            functionName:'f_doCommand(61)',
            descr:'бот відправляє в чат повідомлення із рандомним мемом',
            msgInput:'/замути',
            msgOutput:'<img src="https://i.ibb.co/Fk039MdS/1731612720837.jpg" width="400px"/>',
            params:[{
                    name:'тип',
                    value:'мем'
                }],
            buttons:[],
            details:'приклад формату команди /замути ...<br>мем рандомний',
            messageType:'message-embed'
        },
        {
            cathegory:'economics',
            name:'/викинути',
            functionName:'f_doCommand(62)',
            descr:'видалити предмет зі свого інвентаря',
            msgInput:'/викинути',
            msgOutput:'компухтер був видалений із вашого інвентаря',
            params:[{
                    name:'найменування',
                    value:'компухтер'
                }],
            buttons:[],
            details:'',
            messageType:'message-text'
        },
        {
            cathegory:'dowith',
            name:'',
            functionName:'f_doCommand(63)',
            descr:'',
            msgInput:'',
            msgOutput:'',
            params:[],
            buttons:[],
            details:'',
            messageType:'message-text'
        },
    ];

function main(){
    let text = '';
    for(let item of commArr){
        if(item.cathegory === 'main' && item.name && item.functionName){
            text += `<p><button class="commButt" onclick = "${item.functionName}"> ${item.name} </button> - `
            +`${item.descr}</p>`;
        }
    }
    document.getElementById("commandList").innerHTML = text;
}
function reactions(){
    let text = `<p><button class="commButt" onclick = "f_doCommand(58)">/ааа</button>, `
            +`<button class="commButt" onclick = "f_doCommand(58)">/засмучений</button>, `
            +`<button class="commButt" onclick = "f_doCommand(58)">/метально</button>, `
            +`<button class="commButt" onclick = "f_doCommand(58)">/мяу</button>, `
            +`<button class="commButt" onclick = "f_doCommand(58)">/но-комент</button>, `
            +`<button class="commButt" onclick = "f_doCommand(58)">/ня</button>, `
            +`<button class="commButt" onclick = "f_doCommand(58)">/плачу</button>, `
            +`<button class="commButt" onclick = "f_doCommand(58)">/помити-руки</button>, `
            +`<button class="commButt" onclick = "f_doCommand(58)">/фейспалм</button>, `
            +`<button class="commButt" onclick = "f_doCommand(58)">/шок</button>, `
            +`<button class="commButt" onclick = "f_doCommand(58)">/я-в-захваті</button></p>`;
    document.getElementById("commandList").innerHTML = text;
}
function dowith(){
    let text = `<p><button class="commButt" onclick = "f_doCommand(59)">/банана-стікер</button>, `
            +`<button class="commButt" onclick = "f_doCommand(59)">/врізати</button>, `
            +`<button class="commButt" onclick = "f_doCommand(59)">/дати печеньку</button>, `
            +`<button class="commButt" onclick = "f_doCommand(59)">/дати ляпаса</button>, `
            +`<button class="commButt" onclick = "f_doCommand(59)">/крутяк</button>, `
            +`<button class="commButt" onclick = "f_doCommand(59)">/кусь</button>, `
            +`<button class="commButt" onclick = "f_doCommand(59)">/кілл</button>, `
            +`<button class="commButt" onclick = "f_doCommand(59)">/обійняти</button>, `
            +`<button class="commButt" onclick = "f_doCommand(59)">/погладити</button>, `
            +`<button class="commButt" onclick = "f_doCommand(59)">/респект</button>, `
            +`<button class="commButt" onclick = "f_doCommand(59)">/тиха-будь</button>, `
            +`<button class="commButt" onclick = "f_doCommand(59)">/тиць</button>, `
            +`<button class="commButt" onclick = "f_doCommand(59)">/тіскати</button>, `
            +`<button class="commButt" onclick = "f_doCommand(59)">/цмок</button>, `
            +`<button class="commButt" onclick = "f_doCommand(59)">/шльопнути</button></p>`
            +`<p><button class="commButt" onclick = "f_doCommand(60)"> /пара-дня </button> - `
            +`вибирає рандомну пару дня із користувачів серверу</p>`
            +`<p>Також можна мутити різне: <button class="commButt" onclick = "f_doCommand(61)"> /замути мем </button>, `
            +`<button class="commButt" onclick = "f_doCommand(61)">/замути лапки</button>, `
            +`<button class="commButt" onclick = "f_doCommand(61)">/замути калейдоскоп</button>, `
            +`<button class="commButt" onclick = "f_doCommand(61)">/замути уран</button>, `
            +`<button class="commButt" onclick = "f_doCommand(61)">/замути тессеракт</button>, `
            +`<button class="commButt" onclick = "f_doCommand(61)">/замути мені-пару</button></p>`;
    document.getElementById("commandList").innerHTML = text;
}
function economics(){
    let text = '';
    for(let item of commArr){
        if(item.cathegory === 'economics' && item.name && item.functionName){
            text += `<p><button class="commButt" onclick = "${item.functionName}"> ${item.name} </button> - `
            +`${item.descr}</p>`;
        }
    }
    document.getElementById("commandList").innerHTML = text;
}
function admin(){
    let text = '';
    for(let item of commArr){
        if(item.cathegory === 'admin' && item.name && item.functionName){
            text += `<p><button class="commButt" onclick = "${item.functionName}"> ${item.name} </button> - `
            +`${item.descr}</p>`;
        }
    }
    document.getElementById("commandList").innerHTML = text;
}
function games(){
    let text = '';
    for(let item of commArr){
        if(item.cathegory === 'games' && item.name && item.functionName){
            text += `<p><button class="commButt" onclick = "${item.functionName}"> ${item.name} </button> - `
            +`${item.descr}</p>`;
        }
    }
    document.getElementById("commandList").innerHTML = text;
}

function f_doCommand(index){
    let contentBlock;
    if(commArr[index].messageType === "message-text"){
        document.getElementById("message-embed").style.display = "none";
        contentBlock = document.getElementById("message-text");
        contentBlock.style.display = "block";
        let messageBlock = document.getElementById('message');
        messageBlock.style.backgroundColor = 'rgba(0,0,0,0.0)';
        messageBlock.style.borderLeft = 'none';
    }
    if(commArr[index].messageType === "message-text-mentioned"){
        document.getElementById("message-embed").style.display = "none";
        contentBlock = document.getElementById("message-text");
        contentBlock.style.display = "block";
        let messageBlock = document.getElementById('message');
        messageBlock.style.backgroundColor = '#3B3734';
        messageBlock.style.borderLeft = 'solid 3px #CE9C5C';
    }
    if(commArr[index].messageType === "message-embed"){
        document.getElementById("message-text").style.display = "none";
        contentBlock = document.getElementById("message-embed");
        contentBlock.style.display = "block";
        let messageBlock = document.getElementById('message');
        messageBlock.style.backgroundColor = 'rgba(0,0,0,0.0)';
        messageBlock.style.borderLeft = 'none';
    }
    
    let msgInput = `<div id="commName">${commArr[index].msgInput}</div>`;
    if(commArr[index].params){
        for(let param of commArr[index].params){
            msgInput += `<div id="commParams"><div id="paramName">${param.name}</div><div id="paramValue">${param.value}</div></div>&nbsp;&nbsp;&nbsp;`;
        }
    }
    document.getElementById('msgInput').innerHTML = msgInput;
    contentBlock.innerHTML = commArr[index].msgOutput;
    if(commArr[index].buttons){
        let buttField = ''
        document.getElementById('message-buttons').style.display = 'block';
        for(const button of commArr[index].buttons){
            buttField += `<div class="msgButt">${button}</div>`
        }
        document.getElementById('message-buttons').innerHTML = buttField;
    } else {
        document.getElementById('message-buttons').style.display = 'none';
    }
    if(commArr[index].details){
        document.getElementById('explains').innerHTML = commArr[index].details;
    } else {
        document.getElementById('explains').innerHTML = '';
    }
}

function f_showCommand(index){
    let contentBlock;
    if(commArr[index].messageType === "message-text"){
        document.getElementById("message-embed").style.display = "none";
        contentBlock = document.getElementById("message-text");
        contentBlock.style.display = "block";
        let messageBlock = document.getElementById('message');
        messageBlock.style.backgroundColor = 'rgba(0,0,0,0.0)';
        messageBlock.style.borderLeft = 'none';
    }
    if(commArr[index].messageType === "message-text-mentioned"){
        document.getElementById("message-embed").style.display = "none";
        contentBlock = document.getElementById("message-text");
        contentBlock.style.display = "block";
        let messageBlock = document.getElementById('message');
        messageBlock.style.backgroundColor = '#3B3734';
        messageBlock.style.borderLeft = 'solid 3px #CE9C5C';
    }
    if(commArr[index].messageType === "message-embed"){
        document.getElementById("message-text").style.display = "none";
        contentBlock = document.getElementById("message-embed");
        contentBlock.style.display = "block";
        let messageBlock = document.getElementById('message');
        messageBlock.style.backgroundColor = 'rgba(0,0,0,0.0)';
        messageBlock.style.borderLeft = 'none';
    }
    
    let msgInput = `<div id="commName">${commArr[index].msgInput}</div>`;
    if(commArr[index].params){
        for(let param of commArr[index].params){
            msgInput += `<div id="commParams"><div id="paramName">${param.name}</div><div id="paramValue">${param.value}</div></div>&nbsp;&nbsp;&nbsp;`;
        }
    }
    document.getElementById('msgInput').innerHTML = msgInput;
    contentBlock.innerHTML = commArr[index].msgOutput;
    if(commArr[index].buttons){
        let buttField = ''
        document.getElementById('message-buttons').style.display = 'block';
        for(const button of commArr[index].buttons){
            buttField += `<div class="msgButt">${button}</div>`
        }
        document.getElementById('message-buttons').innerHTML = buttField;
    } else {
        document.getElementById('message-buttons').style.display = 'none';
    }
    if(commArr[index].details){
        document.getElementById('explains').innerHTML = commArr[index].details;
    } else {
        document.getElementById('explains').innerHTML = '';
    }
}