{
	"events":[
		{
			"id":15,
			"date":"2020-03-23T16:32",
			"about":"Карантинний чіл...",
			"tags":["diary", "javaE", "careerkhpi", "karantin2020"],
			"content":"<p>Карантинний чіл.</p><p>У всьому світі застосовують карантинні заходи у зв'язку із поширенням нового мутованого вірусу грипу CoViD19. Сьогодні закрили весь громадський транспорт міський, міжміський, міждержавний, крім трамваїв і маршруток. І то, хто зна, чи довго ще трамваї їздитимуть. Вчора був останній автобусний рейс із Харкова до ЧЗ, яким я поспішно виїхала.</p><p>По новинам постійно показують новини про події, пов'язані з цією ситуацією: люди із сумками на вокзалах, черги на маршрутки о 6-й ранку, всі кучкуються і більшість без масок, масові закупки людьми продуктів першої необхідності. Та в мене сьогодні просто пречудовий день: прибирання в кімнаті, розпаковка сумки, упорядкування речей, підключення другого монітору (один монітор привіз мені в общагу тато майже місяць тому, а вдома є ще один)... Ну, не такий уже і пречудовий по продуктивності, т.к. я уже підзабила на курси <b>Java EPAM</b>, досі не можу довести до ума третю практику, коли інші уже зробили 10 і приступили до виконання фінального завдання. Застрягла на одній дрібниці, з якою не знаю що робити, ну задавати питання про неї в груповому чаті уже, напевно, пізнувато. Та і все ще не упорядкувала матеріали по предметам, т.к. у нас навчання в університеті все ще триває, але дистанційно. Преподи скидають кучу якоїсь інформації, я ніяк не можу зорієнтуватися і запланувати що коли куди і навіщо.<p><div align=\"center\" id=\"imgDiv\"><a href=\"../../album/past/2020.03.17.jpg\"><img src=\"../../album/past/2020.03.17.jpg\" height=\"200\" title=\"Під Зіньковим у нашого автобуса сталася невеличка пригода: пробило колесо. Водій сам міняв камеру близько пів-години\"></a></div><p>Та все ж відчуваю себе пречудово. Є одна річ, яка мене здорово бадьорить: по одному із предметів у нас практика із STM32 і препод дозволив мені взяти з собою додому отладочну плату, то я вже не дочекаюся, коли нарешті в мене з'явиться можливість із нею попрацювати. Ну і моє робоче місце мене підбадьорює і налаштовує на роботу: на ноуті - вінда, на моніторі - лінукс на вірт. машині.</p><div align=\"center\" id=\"imgDiv\"><a href=\"../../album/past/2020.03.18.jpg\"><img src=\"../../album/past/2020.03.18.jpg\" height=\"200\" title=\"Хочу установити Хроміум на Лінукс, в туторіалі написали ввести якусь команду - уже другу годину качаються якісь обнови\"></a></div><p>Є, щоправда, одна невеличка незручність, пов'язана із дистанційним навчанням: необхідність установки по одному із предметів Matlab. Незручність пов'язана з тим, що ця програма вимагає ліцензії і жостко моніторе її наявність у вже встановлених програмах через інтернет. Не всякий кряк успішно дозволяє з нею боротися. У мене уже присутній важкий досвід кількох безуспішних установок різних версій із різних джерел. Тому я вирішила цього разу поставити цю прогу на віртуальну машину і кожного разу при запуску віртуальної ОС просто відключати інтернет. Але так як моя віртуальна ОС - лінукс, а матлаб із кряком - на рутрекері, з'явилися деякі складності із установкою торрента, т.к. там треба типу розгортати прямо торрент сервер чи типу того і у всих туторіалах по установці треба просто копіювати і вставляти купу якихось незрозумілих команд. І всеодно потім якісь помилки. Мб завтра розберуся...</p><p>Іще один приємний момент: мені дали адмінку сайта <b>Центру \"Кар'єра НТУ \"ХПІ\"\"</b>. Залишилося написати пару статей, виправити пару помилочок - і наш сайт заговорить із користувачем зрозумілою милозвучною мовою.</p>"
		},
		{
			"id":14,
			"date":"2019-12-15T18:32",
			"about":"Завал, завал. Строки горять. Сесія близько...",
			"tags":["diary", "javaE", "careerkhpi", "karantin2020"],
			"content":"<p>Завал, завал. Строки горять. Сесія близько.</p><p>Більшість часу було присвячено виконанню завдань по університетським предметам: РГЗ по інтелектуальній власності, СММіКМ, МПТ, курсача по ТАР, презентації по фізіології. Додалося завдання по научній роботі. Намагалася дописати статті на сайт ЦК. </p><p>На курсах <b>Java EPAM</b> особливих успіхів не досягаю: тести пишу не дуже добре, хоча, порівняно з іншими, нормально. Ну це так собі рівень, я могла б і краще, якби більше старалася. Більшість моїх колег уже давно в цій темі, ймовірно, а я тільки і пам'ятаю уривки того, що вчила роки два тому сама вдома на якомусь сайті.</p><p>У середу, 11.12, у нашої підгрупи була перша практика. Ще минулого тижня на лекції нам говорили, що ми будемо працювати із командною строкою. Після пар я пішла в кафе з кісками готуватися морально і інформаційно: прочитала пару статей, виписала пару команд, які так і не знадобилися в результаті. Трохи знадобилося те, що встигла записати на лекції, т.к. якої-небудь методички чи презентації нам не дали. Зате на практиці був приклад. Хоча командну строку я бачила не вперше і гітлаб також, та моя взаємодія з ними завжди зводилася до Ctl+C/Ctrl+V команд із якого-небудь інтернет-руководства. На практиці, в принципі, все було приблизно так же, але чомусь усеодно довго мучалась. Досі ніхто не знає про ту паніку, яку я відчуваю кожного разу, коли сідаю за роботу із СКВ і командною строкою. На linuxsurvival.com було просто і весело вводити всі ці команди, а тут чомусь страшно: раптом щось зламається і тільки переустановка ОС врятує ситуацію. А в моєму випадку переустановка ОС - це наче пережити ядерну зиму в бункері.</p><p>В результаті я зробила 4 завдання із 5, і то половина не працює. А на вихідних на мене чекав сюрпрайз: відкрили доступ до репозиторію, та туди треба заливати уже інші завдання. І не 5, а 7. Ну, думаю, в суботу зроблю горящі завдання по універу, а в неділю буду займатися прогами. І тут накривається сервер СКВ з репозиторієм. Уже цілий день немає доступу. Ну що ж. Я уже не нервую. Буде, що буде. Не знаю, що. Невідомість спантеличує і лякає, та треба уже якось до неї звикати, якось осмислити може.</p><p>На щастя, Світ не крутиться навколо одних лише курсів. Ще тиждень-два - і можна розслабитися. Залишиться лише научна робота, Центр кар'єри і курси.</p><p>7.12 назбирала макулатури у вигляді конспектів моїх, одногрупниці, чєла із чатіка і з поверху, а також стопку аркушів А4 і А1 із тренінгу, щоб здати по акції \"Добрый немусор\" від <b>Kharkov Eco City</b>. Дуже хотіла назбирати більше 10 кг, так як це дозволило б мені отримати блокнотик із перероблених одноразових паперових стаканчиків з-під кави. В результаті я назбирала більше 15 кг макулатури (якимось дивом усе це дотащила) і забрала у них останній блокнотик. Тепер він лежить на моїй поличці, чекає своєї участі.</p><div align=\"center\" id=\"imgDiv\"><a href=\"media/photo/2019.12.6.jpg\"><img src=\"media/photo/2019.12.6.jpg\" height=\"200\" title=\"Мої конспекти, майже 3 кг\"></a><a href=\"media/photo/2019.12.7 (1).png\"><img src=\"media/photo/2019.12.7 (1).png\" height=\"200\" title=\"Тут - мої конспекти і конспекти чєла із чатіка Подслушано ХПИ\"></a><a href=\"media/photo/2019.12.7 (2).png\"><img src=\"media/photo/2019.12.7 (2).png\" height=\"200\" title=\"Ще там можна сфоткатися з табличкою з прикольним написом\"></a></div><p>У п'ятницю 6.12 (чи суботу) сусідка отримала посилку нарешті: набір <b>Arduino</b> Йода, який замовила її кафедра в якості подарунку. І, раз уже ми з нею це все розпакували, я вирішила ще й потестити цю плату. Ця плата програмується на Java Script, я спочатку не вірила, що так можна, поки сама не спробувала: середовище програмування завантажується у вигляді додатку Espruino Web IDE в гугл хром і ставляться дрова для програматора (у мене вони вже стояли, т.к. в платі стоїть МК STM32, а ми з цим МК працюємо в універі). У Espruino цікавий інтерфейс: справа пишеться код програми, а зліва - щось типу терміналу, через який можна спілкуватися з платою за допомогою методів JS. І ще плата на \"Hello\" відповідає \"Hello!\"</p><div align=\"center\" id=\"imgDiv\"><a href=\"media/photo/2019.12.9.jpg\"><img src=\"media/photo/2019.12.9.jpg\" height=\"200\" title=\"Це я відправляю сусідці фото інтерфейсу в понеділок вранці, коли я сіла тестити плату\"></a></div><p>8.12. прийшли результати 1 етапу конкурсу <b>LoNG</b>. Наша команда не потрапила в 10 кращих. Зате ця робота внесла різноманіття в моє життя, розширила мій кругозір і допомогла краще пізнати себе. Хоча я й сама змінилася, я про це зовсім не жалію. Ще не думала про те, що я втратила, та те, що отримала, буде корисним і точно знадобиться в професійній діяльності.</p><p>13.12 зателефонувала представнику Южгіпроруди, щоб він дав згоду на публікацію статті з його інтерв'ю на сайті <b>Центру кар'єри</b>. Він ніби погодився. На сьогодні в мене вже є готові 4 статті для публікації на сайті, та їх іще треба перекласти на 3 мови, а деякі ще треба довести до ума.</p><p>Можливо варто тут згадати про деякі дрібні побутові неприємності, які сталися останнім часом: перестановка ліжок у нашій общажній кімнаті, нарахування субсидії розміром 27 грн за три місяці (не зрозуміло, чи це частина того, що має бути, чи це все), запущені підрахунки витрат (повна шухляда чеків). Та не хочу вже це все розписувати.</p>"
		}
	]
}